{
  "id": "linux_hardening_ab3c04fcc3e3",
  "category": "linux-hardening",
  "title": "understanding selinux",
  "description": "# Understanding and Using SELinux\n\nSELinux, or Security-Enhanced Linux, is an advanced access control mechanism integrated into the Linux kernel. Initially developed by the National Security Agency (NSA), it provides Mandatory Access Control (MAC) unlike traditional Unix/Linux access control which provides Discretionary Access Control (DAC). In this article, we will explore the basics of SELinux and how to use it effectively.\n\n**NOTE:** Check the out the two labs I have here: [CENTOS LAB](https:",
  "payloads": [
    "# Understanding and Using SELinux",
    "SELinux, or Security-Enhanced Linux, is an advanced access control mechanism integrated into the Linux kernel. Initially developed by the National Security Agency (NSA), it provides Mandatory Access Control (MAC) unlike traditional Unix/Linux access control which provides Discretionary Access Control (DAC). In this article, we will explore the basics of SELinux and how to use it effectively.",
    "**NOTE:** Check the out the two labs I have here: [CENTOS LAB](https://github.com/The-Art-of-Hacking/h4cker/blob/master/linux-hardening/selinux_CENTOS_lab.md) and [UBUNTU SELINUX LAB](https://github.com/The-Art-of-Hacking/h4cker/blob/master/linux-hardening/selinux_UBUNTU_lab.md).",
    "## Introduction to SELinux",
    "SELinux adds another layer of access control, defining how/what a user process can access. It makes use of policies to enforce the rules that govern these permissions. It's designed to protect the integrity of the system, even when a process is compromised, by limiting potential damage.",
    "SELinux has three modes of operation:",
    "1. **Enforcing:** SELinux policy is enforced. SELinux denies access based on SELinux policy rules.",
    "2. **Permissive:** SELinux policy is not enforced. SELinux does not deny access, but denials are logged for actions that would have been denied if running in enforcing mode.",
    "3. **Disabled:** SELinux is fully disabled.",
    "You can check the current status of SELinux by using the command: `sestatus`",
    "## Working with SELinux",
    "To get started with SELinux, you need to understand its concepts of 'Types' and 'Contexts':",
    "- **Type Enforcement:** The primary mechanism of access control used in SELinux is Type Enforcement. Everything that acts upon or is acted upon in a system is assigned a type: files, directories, ports, and even processes have types.",
    "- **Security Contexts:** SELinux attaches a security context to every system object. This context includes information like SELinux user, role, type, and, optionally, security level. You can view the security context of a file or process using `-Z` option with `ls` or `ps` command respectively.",
    "For example, to view the context of files in a directory:"
  ],
  "source": "h4cker",
  "references": [
    "/workspaces/hunter-skill/h4cker/linux-hardening/understanding_selinux.md"
  ]
}