{
  "id": "temp_a5d20c6dba79",
  "category": "temp",
  "title": "wireless adapters",
  "description": "# Penetration Testing and Wireless Adapters\nAs you learned either in one of my books, courses, or in the Internet, there are many challenges with different wireless adapters, Linux, and wireless penetration testing tools. This is a fact especially when trying to perform promiscuous monitoring and injecting packets into the wireless network.\n\nThe following are some of the most popular wireless adapters used by penetration testers (ethical hackers) in the industry.\n\n**Note**: If you know of others",
  "payloads": [
    "# Penetration Testing and Wireless Adapters",
    "As you learned either in one of my books, courses, or in the Internet, there are many challenges with different wireless adapters, Linux, and wireless penetration testing tools. This is a fact especially when trying to perform promiscuous monitoring and injecting packets into the wireless network.",
    "The following are some of the most popular wireless adapters used by penetration testers (ethical hackers) in the industry.",
    "**Note**: If you know of others and have some success stories, please feel free to contribute by requesting a pull request or by opening a GitHub issue.",
    "## Good Resources of Field Tested Wireless Adapters",
    "- [Select a Field-Tested Kali Linux Compatible Wireless Adapter](https://null-byte.wonderhowto.com/how-to/select-field-tested-kali-linux-compatible-wireless-adapter-0180076/)",
    "- [Best Wireless Network Adapter for Wi-Fi ](https://null-byte.wonderhowto.com/how-to/buy-best-wireless-network-adapter-for-wi-fi-hacking-2018-0178550/)",
    "## Additional Notes Based on My Personal Testing",
    "### Atheros (AR5XXX, AR9XXX)",
    "Atheros chipsets have been used by many pen testers in the industry because the ability to perform well with many different systems and because it is open source. The main challenge with these drivers is that many laptops have migrated from PCMCIA bus and support for external Atheros-based cards is pretty limited.",
    "### Realtek (RTL8187)",
    "The RTL8187 driver is used in many Alfa adapters (USB adapters). The RTL8187 driver is supported by the Linux kernel for years and has been the choice for many pen testers out there. The main challenge with this driver is the lack of 802.11 a, n, and ac support. It can be used for injecting packets into the wireless network and it works with MAC OS X.",
    "### Intel Pro Wireless (iwlwifi)",
    "Many vendors out there use Intel 802.11 chipsets in their laptops and desktop systems in the PCIe bus.",
    "**Note:** Latest versions of the Intel chipsets are supported by the `iwlwifi` or the `iwlagn` Linux drivers and supported by recent kernels."
  ],
  "source": "h4cker",
  "references": [
    "/workspaces/hunter-skill/h4cker/temp/Ethical_Hacking/Attacks_and_Exploits/Wireless_Attacks/wireless_resources/wireless_adapters.md"
  ]
}