{
  "id": "todo_a1e2666d1936",
  "category": "todo",
  "title": "cookies policy",
  "description": "# Cookies Policy\n\nLast updated: 02/04/2023\n\n### Introduction\n\nThis Cookies Policy applies to the following websites owned and operated by HackTricks team (\"HackTricks\", \"we\", \"us\" or \"our\"):\n\n* hacktricks.wiki\n* [www.hacktricks.wiki](https://www.hacktricks.wiki/)\n* book.hacktricks.wiki\n* cloud.hacktricks.wiki\n\nBy using any of these websites, you agree to the use of cookies in accordance with this Cookies Policy. If you do not agree, please disable cookies in your browser settings or refrain from",
  "payloads": [
    "# Cookies Policy",
    "Last updated: 02/04/2023",
    "### Introduction",
    "This Cookies Policy applies to the following websites owned and operated by HackTricks team (\"HackTricks\", \"we\", \"us\" or \"our\"):",
    "* hacktricks.wiki",
    "* [www.hacktricks.wiki](https://www.hacktricks.wiki/)",
    "* book.hacktricks.wiki",
    "* cloud.hacktricks.wiki",
    "By using any of these websites, you agree to the use of cookies in accordance with this Cookies Policy. If you do not agree, please disable cookies in your browser settings or refrain from using our websites.",
    "### What are cookies?",
    "Cookies are small text files that are stored on your computer or mobile device when you visit a website. They are widely used to make websites work, improve their functionality, and provide a more personalized user experience.",
    "### How we use cookies",
    "We use cookies on our websites for the following purposes:",
    "1. Essential cookies: These cookies are necessary for the basic functionality of our websites, such as enabling user authentication, maintaining security, and remembering your preferences.",
    "2. Performance cookies: These cookies help us understand how visitors interact with our websites, by collecting and reporting information anonymously. This allows us to improve our website performance and user experience."
  ],
  "source": "HackTricks",
  "references": [
    "/workspaces/hunter-skill/hacktricks/src/todo/cookies-policy.md"
  ]
}