{
  "id": "windows_hardening_b45cb0e9094a",
  "category": "windows-hardening",
  "title": "integrity levels",
  "description": "# Integrity Levels\n\n{{#include ../../banners/hacktricks-training.md}}\n\n## Integrity Levels\n\nIn Windows Vista and later versions, all protected items come with an **integrity level** tag. This setup mostly assigns a \"medium\" integrity level to files and registry keys, except for certain folders and files that Internet Explorer 7 can write to at a low integrity level. The default behavior is for processes initiated by standard users to have a medium integrity level, whereas services typically oper",
  "payloads": [
    "# Integrity Levels",
    "{{#include ../../banners/hacktricks-training.md}}",
    "## Integrity Levels",
    "In Windows Vista and later versions, all protected items come with an **integrity level** tag. This setup mostly assigns a \"medium\" integrity level to files and registry keys, except for certain folders and files that Internet Explorer 7 can write to at a low integrity level. The default behavior is for processes initiated by standard users to have a medium integrity level, whereas services typically operate at a system integrity level. A high-integrity label safeguards the root directory.",
    "A key rule is that objects can't be modified by processes with a lower integrity level than the object's level. The integrity levels are:",
    "- **Untrusted**: This level is for processes with anonymous logins. Example: Chrome",
    "- **Low**: Mainly for internet interactions, especially in Internet Explorer's Protected Mode, affecting associated files and processes, and certain folders like the **Temporary Internet Folder**. Low integrity processes face significant restrictions, including no registry write access and limited user profile write access.",
    "- **Medium**: The default level for most activities, assigned to standard users and objects without specific integrity levels. Even members of the Administrators group operate at this level by default.",
    "- **High**: Reserved for administrators, allowing them to modify objects at lower integrity levels, including those at the high level itself.",
    "- **System**: The highest operational level for the Windows kernel and core services, out of reach even for administrators, ensuring protection of vital system functions.",
    "- **Installer**: A unique level that stands above all others, enabling objects at this level to uninstall any other object.",
    "You can get the integrity level of a process using **Process Explorer** from **Sysinternals**, accessing the **properties** of the process and viewing the \"**Security**\" tab:",
    "![](<../../images/image (824).png>)",
    "You can also get your **current integrity level** using `whoami /groups`",
    "![](<../../images/image (325).png>)"
  ],
  "source": "HackTricks",
  "references": [
    "/workspaces/hunter-skill/hacktricks/src/windows-hardening/windows-local-privilege-escalation/integrity-levels.md"
  ]
}