{
  "id": "windows_hardening_eedb6bad8994",
  "category": "windows-hardening",
  "title": "abusing auto updaters and ipc",
  "description": "# Abusing Enterprise Auto-Updaters and Privileged IPC (e.g., Netskope, ASUS & MSI)\n\n{{#include ../../banners/hacktricks-training.md}}\n\nThis page generalizes a class of Windows local privilege escalation chains found in enterprise endpoint agents and updaters that expose a low\\-friction IPC surface and a privileged update flow. A representative example is Netskope Client for Windows < R129 (CVE-2025-0309), where a low\\-privileged user can coerce enrollment into an attacker\\-controlled server and ",
  "payloads": [
    "# Abusing Enterprise Auto-Updaters and Privileged IPC (e.g., Netskope, ASUS & MSI)",
    "{{#include ../../banners/hacktricks-training.md}}",
    "This page generalizes a class of Windows local privilege escalation chains found in enterprise endpoint agents and updaters that expose a low\\-friction IPC surface and a privileged update flow. A representative example is Netskope Client for Windows < R129 (CVE-2025-0309), where a low\\-privileged user can coerce enrollment into an attacker\\-controlled server and then deliver a malicious MSI that the SYSTEM service installs.",
    "Key ideas you can reuse against similar products:",
    "- Abuse a privileged service’s localhost IPC to force re\\-enrollment or reconfiguration to an attacker server.",
    "- Implement the vendor’s update endpoints, deliver a rogue Trusted Root CA, and point the updater to a malicious, “signed” package.",
    "- Evade weak signer checks (CN allow\\-lists), optional digest flags, and lax MSI properties.",
    "- If IPC is “encrypted”, derive the key/IV from world\\-readable machine identifiers stored in the registry.",
    "- If the service restricts callers by image path/process name, inject into an allow\\-listed process or spawn one suspended and bootstrap your DLL via a minimal thread\\-context patch.",
    "## 1) Forcing enrollment to an attacker server via localhost IPC",
    "Many agents ship a user\\-mode UI process that talks to a SYSTEM service over localhost TCP using JSON.",
    "Observed in Netskope:",
    "- UI: stAgentUI (low integrity) ↔ Service: stAgentSvc (SYSTEM)",
    "- IPC command ID 148: IDP_USER_PROVISIONING_WITH_TOKEN",
    "Exploit flow:"
  ],
  "source": "HackTricks",
  "references": [
    "/workspaces/hunter-skill/hacktricks/src/windows-hardening/windows-local-privilege-escalation/abusing-auto-updaters-and-ipc.md"
  ]
}