{
  "id": "windows_7b805c86f1c1",
  "category": "windows",
  "title": "ldap enumeration",
  "description": "# Useful LDAP Queries\n\nLightweight Directory Access Protocol (LDAP) is a protocol used to access and manage directory information services over an IP network. In Windows Active Directory (AD) domains, LDAP plays a crucial role in storing and retrieving a vast amount of information, including user accounts, group memberships, computer accounts, and more. For penetration testers and security professionals, querying LDAP can reveal valuable insights into the domain's structure, potential misconfigu",
  "payloads": [
    "# Useful LDAP Queries",
    "Lightweight Directory Access Protocol (LDAP) is a protocol used to access and manage directory information services over an IP network. In Windows Active Directory (AD) domains, LDAP plays a crucial role in storing and retrieving a vast amount of information, including user accounts, group memberships, computer accounts, and more. For penetration testers and security professionals, querying LDAP can reveal valuable insights into the domain's structure, potential misconfigurations, and vulnerabilities.",
    "## Understanding LDAP Query Operators",
    "Some LDAP queries utilize special comparison operators, particularly when filtering based on attributes like `userAccountControl`. Understanding these operators is essential for crafting effective queries.",
    "| Operator                               | OID                      | Description                                                                                                                                                                                                                                                     |",
    "|----------------------------------------|--------------------------|-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|",
    "| **LDAP_MATCHING_RULE_BIT_AND**         | `1.2.840.113556.1.4.803` | Performs a bitwise \"AND\" operation. Useful for checking if specific bits are set in an attribute like `userAccountControl`.                                                                                                                                     |",
    "| **LDAP_MATCHING_RULE_BIT_OR**          | `1.2.840.113556.1.4.804` | Performs a bitwise \"OR\" operation.                                                                                                                                                                                                                              |",
    "| **LDAP_MATCHING_RULE_TRANSITIVE_EVAL** | `1.2.840.113556.1.4.1941`| Performs a recursive search of a link attribute. Useful for finding all members of a group, including nested group members. [See Microsof's documentation](https://docs.microsoft.com/en-us/windows/win32/adschema/adschema-search-filter-syntax) |",
    "| **LDAP_MATCHING_RULE_DN_WITH_DATA**    | `1.2.840.113556.1.4.2253`| Matches portions of values of syntax `Object(DN-String)` and `Object(DN-Binary)`.                                                                                                                                                                               |",
    "## Users",
    "### List All Users",
    "To retrieve all user accounts in the domain, you can use the following query:",
    "```ldap",
    "(&(objectCategory=person)(objectClass=user))"
  ],
  "source": "h4cker",
  "references": [
    "/workspaces/hunter-skill/h4cker/windows/ldap_enumeration.md"
  ]
}