{
  "id": "xss-a61714ba021f",
  "category": "XSS",
  "title": "README",
  "description": "# Open URL Redirect\n\n> Un-validated redirects and forwards are possible when a web application accepts untrusted input that could cause the web application to redirect the request to a URL contained within untrusted input. By modifying untrusted URL input to a malicious site, an attacker may successfully launch a phishing scam and steal user credentials. Because the server name in the modified link is identical to the original site, phishing attempts may have a more trustworthy appearance. Un-va",
  "payloads": [
    "* [HTTP Redirection Status Code](#http-redirection-status-code)",
    "https://example.com/redirect?url=https://userpreferredsite.com",
    "* [300 Multiple Choices](https://httpstatuses.com/300) - This indicates that the request has more than one possible response. The client should choose one of them.",
    "* [301 Moved Permanently](https://httpstatuses.com/301) - This means that the resource requested has been permanently moved to the URL given by the Location headers. All future requests should use the new URI.",
    "* [302 Found](https://httpstatuses.com/302) - This response code means that the resource requested has been temporarily moved to the URL given by the Location headers. Unlike 301, it does not mean that the resource has been permanently moved, just that it is temporarily located somewhere else.",
    "* [303 See Other](https://httpstatuses.com/303) - The server sends this response to direct the client to get the requested resource at another URI with a GET request.",
    "* [304 Not Modified](https://httpstatuses.com/304) - This is used for caching purposes. It tells the client that the response has not been modified, so the client can continue to use the same cached version of the response.",
    "* [305 Use Proxy](https://httpstatuses.com/305) -  The requested resource must be accessed through a proxy provided in the Location header.",
    "* [307 Temporary Redirect](https://httpstatuses.com/307) - This means that the resource requested has been temporarily moved to the URL given by the Location headers, and future requests should still use the original URI.",
    "* [308 Permanent Redirect](https://httpstatuses.com/308) - This means the resource has been permanently moved to the URL given by the Location headers, and future requests should use the new URI. It is similar to 301 but does not allow the HTTP method to change.",
    "* Using slashes in URLs: `https://example.com/redirect/http://malicious.com`",
    "* Injecting relative paths: `https://example.com/redirect/../http://malicious.com`",
    "var redirectTo = \"http://trusted.com\";",
    "**Payload**: `?redirectTo=http://malicious.com`",
    "* Using \"`//`\" and \"`////`\" to bypass \"http\" blacklisted keyword"
  ],
  "references": [
    "PayloadsAllTheThings/Open Redirect/README.md"
  ],
  "source": "PayloadsAllTheThings"
}